# Задача 2. Вариант 3.
# Напишите программу, которая будет выводить на экран наиболее понравившееся
# вам высказывание, автором которого является Нострадамус. Не забудьте о том,
# что автор должен быть упомянут на отдельной строке.
# Gamidov A. Z.
# 02.11.2016

print("Жизнь - это череда выборов.")
print("\t\t\t\tНострадамус")
input("\nНажмите Enter для выхода.")
