# Задача 1. Вариант 3.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под
# которым скрывается Вильгельм Аполлинарий Костровицкий. После вывода
# информации программа должна дожидаться пока пользователь нажмет Enter для выхода.
# Gamidov A. Z.
# 02.11.2016

print('Вильгельм Альберт Владимир Александр Аполлинарий Вонж-Костровицкий - французский поэт.')
input('Нажмите enter для выхода')
